{
    "seasons": [
        {
            "id": 367,
            "name": "Season of Septuagesima",
            "content": "The Season of Septuagesima is a preparation for the great penitential season of Lent. It is called <em>Septuagesima<\/em>, meaning <em>seventieth day<\/em>, because some of the clergy and faithful in the earliest ages of the Church began to fast seventy days before Easter. The Sundays following are called Sexagesima, Quinquagesima, and Quadragesima (which is the first Sunday of Lent), because some Christians commenced fasting sixty or fifty days before Easter, until forty (quadragesima) became uniform. From Septuagesima until Easter the Church omits in her service all joyful canticles, Alleluias, and the <em>Gloria in excelsis<\/em>. This is gradually to prepare the minds of the faithful for the serious time of penance and sorrow on the horizon; to remind the sinner of the grievousness of his errors, and to exhort him to penance. The liturgical color of the season is violet, the color of penance. To arouse in us sorrow for our sins, and show the need of repentance, the holy liturgy in the name of all mankind cries with David: The groans of death surrounded me, the sorrows of hell encompassed me: and in my affliction I called upon the Lord, and he heard my voice from his holy temple (<em>Goffine<\/em>).",
            "permalink": "https:\/\/fsspx.today\/season\/season-of-septuagesima\/",
            "start": "Sunday 28 January 2024 00:00:00",
            "startTS": 1706400000,
            "end": "Tuesday 13 February 2024 00:00:00",
            "endTS": 1707782400
        },
        {
            "id": 366,
            "name": "Season of Lent",
            "content": "The holy Season of Lent, according to the ancient tradition of the Church, is a penitential season of forty days. This penitential time has three main purposes: to curb the concupiscence of the flesh, to facilitate the elevation of our souls toward divine realities, and to make satisfaction for our sins. Our Lord gave us the example during His life here on earth: pray and do penance! The faithful who have the spirit of the Faith will wholeheartedly enter into the practice of this holy season by means of prayer, fasting, and almsgiving. In their penitential practice, besides fasting and abstinence, souls do well to take on additional penances, which might be abstinence from certain foods and beverages, from television, from electronic devices, or other similar sacrifices. Fervent souls will make an effort to pray more, to assist more frequently at the Holy Sacrifice of the Mass, to recite the Rosary, and not to miss evening prayers with the family. They will detach themselves from everything superfluous in order to draw near to God, the source of the interior life. Sanctity is attained by means of the Cross; if we truly seek perfection then we must follow the Way of the Cross (<em>Archbishop Lefebvre<\/em>).",
            "permalink": "https:\/\/fsspx.today\/season\/season-of-lent\/",
            "start": "Wednesday 14 February 2024 00:00:00",
            "startTS": 1707868800,
            "end": "Saturday 30 March 2024 00:00:00",
            "endTS": 1711756800
        },
        {
            "id": 365,
            "name": "Season of Passiontide",
            "content": "Passiontide is the name given to the last two weeks of Lent, the final week being Holy Week. The holy liturgy, in union with Our Lady of Sorrows, is imbued with sorrowful meditation on the holy Passion of Our Lord and the Church puts on the widow’s garments. One of the most striking changes in the Passiontide is that the crosses and statues are draped, as an outward sign of the Church’s inward sorrow.\r\n\r\nThe veiling of the Cross is a relic from an ancient practice. When crosses, without the corpus, shone glorious with gold and precious stones (the <em>crux gemmata<\/em>), there was deep meaning in the practice of veiling their brilliance during the days when the Bridegroom was taken away. In the spiritual life, we contemplate the various scenes of the bitter passion, we are immersed into all the feelings and thoughts of our suffering Savior, and we adore the virtues displayed by the Lord at every step. \"<em>How shall I imitate Him… what can I learn from Him?<\/em>\" are our most important questions. Suffering is the great motive for amendment: \"<em>He died on the Cross for me, and I have offended Him so deeply<\/em>.\" Indeed, on Good Friday, we lift up our voices, crying: <em>Ave Crux, spes unica! Hail O Cross, our only hope!<\/em> (<em>Parsch<\/em>)",
            "permalink": "https:\/\/fsspx.today\/season\/season-of-passiontide\/",
            "start": "Sunday 17 March 2024 00:00:00",
            "startTS": 1710633600,
            "end": "Saturday 30 March 2024 00:00:00",
            "endTS": 1711756800
        },
        {
            "id": 364,
            "name": "Paschal Season",
            "content": "Christ is risen! The Easter acclamation can be considered a summary of the Faith, an acknowledgment of the reality of what we celebrate in this holiest and most joyous of all the seasons of the liturgical year. After the voluntary penances of Lent, and amidst all the involuntary sufferings of daily life, the Resurrection of Our Lord reminds us not only of the immense love He bears for us, but of our final destiny. The liturgy is the teacher of life. All throughout Lent, we have followed the life of Our Lord leading to his Passion, Death, and Resurrection. Holy Mother Church puts before us the beautiful Collects and readings during this season to help us enter into union with Christ more intimately. Our brief time here in the vale of tears is but a preparation for eternity. The joy and hope of Easter remind us like nothing else can of Our Lord's desire that we remain united to him here on earth and in heaven. Let us take this responsibility seriously, properly celebrating this season which ends with the Octave of Pentecost, and looking forward to the day when all sorrows shall end! Indeed, He is risen!",
            "permalink": "https:\/\/fsspx.today\/season\/paschal-season\/",
            "start": "Sunday 31 March 2024 00:00:00",
            "startTS": 1711843200,
            "end": "Saturday 25 May 2024 00:00:00",
            "endTS": 1716595200
        },
        {
            "id": 363,
            "name": "Season after Pentecost",
            "content": "The Season after Pentecost continues the supernatural growth stemming from Paschaltide, namely, the redemptive Resurrection and Ascension of Our Savior and the following descent of the Paraclete.\r\nThis maturing spiritual life is signified by the verdant green vesture that adorns the altar (e.g., the antependium and veils over the tabernacle and missal stand) and worn by the celebrant. The solemnity of Pentecost and its octave are over, and the progress of the liturgical year introduces us into a new period, which is altogether different from those we have hitherto spent. In this season the sacred liturgy puts before us an almost unbroken succession of varied episodes, of which some are brilliant with glory, and others exquisite in loveliness, but each one of them bringing its special tribute towards either the development of the dogmas of faith, or the furtherance of the Christian life. Such are the great feasts of Corpus Christi, the Sacred Heart, the Most Precious Blood, Our Lady’s Assumption, etc. As the season draws nigh to Advent, it will thus be filled up; it will disappear; a new one will take its place, bringing before us the same divine facts, and pouring forth the same graces on Christ’s Mystical Body (<em>Guéranger<\/em>).",
            "permalink": "https:\/\/fsspx.today\/season\/season-after-pentecost\/",
            "start": "Sunday 26 May 2024 00:00:00",
            "startTS": 1716681600,
            "end": "Saturday 30 November 2024 00:00:00",
            "endTS": 1732924800
        },
        {
            "id": 362,
            "name": "Season of Advent",
            "content": "The holy liturgy of the Advent season is filled with faith in the divinity of Our Lord. Citing above all the Old Testament passages where His coming is foretold, it imbues our minds and hearts with the infinite grandeur of the prerogatives and the rights of the newborn Child. He who from all eternity is begotten of the Father without a mother, is born in time of a mother without a father! Receiving His human nature from the Most Blessed Virgin Mary, His Mother, whose Virginity He preserves, He thereby proves that He has lost nothing of His Divinity.\r\nThe Church prepares during this holy season to welcome the Savior, Jesus, true God and true man. Let us not forget that Advent is a time of penance in which we should redouble our efforts, sacrifices, and prayers. Let us be careful not to celebrate Christmas in advance, or to make this time of preparation a time of celebration and frivolity as do the pagans. If we are generous in preparing in this spirit of penance, we will taste the peacefulness and true joy of Christmas.",
            "permalink": "https:\/\/fsspx.today\/season\/season-of-advent\/",
            "start": "Sunday 1 December 2024 00:00:00",
            "startTS": 1733011200,
            "end": "Tuesday 24 December 2024 00:00:00",
            "endTS": 1734998400
        },
        {
            "id": 369,
            "name": "Season of Christmas",
            "content": "The holy liturgy of the Christmas season is filled with wonder and profound joy at the birth of our Divine Savior. The Word of God was Himself God, the Son of God who “<em>in the beginning was with God,<\/em>” through whom “all things were made” and “<em>without<\/em>” whom “<em>was nothing made<\/em>\" (John 1:1-3).\r\nWith the purpose of delivering man from eternal death, He became man: so bending Himself to take on our humility without decrease in His own majesty. Such then was the Nativity of Jesus Christ of the Blessed Virgin Mary, which was befitting of the Power and Wisdom of God. Therefore the exulting angels’ song at the birth of Our Lord is, “<em>Glory to God in the Highest,<\/em>” and their message is, “<em>peace on earth to men of good will<\/em>\" (Luke 2:14).\r\nHow ought the humbleness of men to rejoice over that indescribable work of the Divine love, when the joy of the lofty angels is so great! As we celebrate this great mystery of peace, the Nativity of Our Lord, we with fervent prayer beseech the gift of peace from Him who is hailed as the Prince of Peace.",
            "permalink": "https:\/\/fsspx.today\/season\/seasons-of-christmas-and-epiphany\/",
            "start": "Wednesday 25 December 2024 00:00:00",
            "startTS": 1735084800,
            "end": "Sunday 5 January 2025 00:00:00",
            "endTS": 1736035200
        },
        {
            "id": 452,
            "name": "Season of Epiphany",
            "content": "The Feast of the Epiphany is the continuation of the mystery of Christmas, but it appears with its own special character. Its very name, which signifies Manifestation, implies that it celebrates the apparition of God to his creatures. The Epiphany is indeed great Feast, and the joy caused us by the Birth of our Jesus is renewed on it, for, as though it were a second Christmas Day, it shows us our Incarnate God in a new light. At Christmas, it was a few Shepherds that were invited by the Angels to go and recognize the Word made flesh; but now, at the Epiphany, the voice of God himself calls the whole world to adore Jesus, and to hear him. The Kings of the East come to the Babe in his crib, bearing with them the prayers and adorations of the whole human race. Mary, the Throne of the divine Wisdom, welcomes all the members of this court with her gracious smile of Mother and Queen; she offers her Son to man, for his adoration, and to God, that he may be well pleased. God manifests himself to men, because he is great: but he manifests himself by Mary, because he is full of mercy (<em>Guéranger<\/em>).",
            "permalink": "https:\/\/fsspx.today\/season\/the-season-of-epiphany\/",
            "start": "Monday 6 January 2025 00:00:00",
            "startTS": 1736121600,
            "end": "Monday 13 January 2025 00:00:00",
            "endTS": 1736726400
        },
        {
            "id": 368,
            "name": "Season after Epiphany",
            "content": "The season begins on the day following the Baptism of Our Lord, and it continues until Septuagesima. The holy liturgy sets before our eyes the mysteries of the public life of Jesus Christ, showing forth His divine power at the Wedding of Cana, on the Sea of Galilee, and through various striking miracles. He teaches the crowds of Palestine, and us as well: “I will open my mouth in parables,” He said, “I will utter things hidden from the foundation of the world” (Mt. 13:35).\r\nGreen, the emblem of hope, is the color for this season. It is, in fact, the ruling color in Nature. St. Paul says that he that plougheth should plough in hope of gathering the fruits of his labor, and in the same way in the Season after Epiphany, the field of the Church, sown with the doctrine and the mighty works of our Lord, abounds with fresh shoots giving promise of a rich harvest.\r\nAn echo of Christmastide, this season has for its characteristic note a holy joy, the joy of sharing in Christ’s kingdom on earth, while confidently hoping that at His return, He will give us a place for all eternity in His kingdom in heaven (<em>Dom Gaspar Lefebvre<\/em>).",
            "permalink": "https:\/\/fsspx.today\/season\/season-after-epiphany\/",
            "start": "Tuesday 14 January 2025 00:00:00",
            "startTS": 1736812800,
            "end": "Saturday 15 February 2025 00:00:00",
            "endTS": 1739577600
        }
    ],
    "massDays": [
        {
            "day": "Friday - Jan 26",
            "dayTS": 1706227200,
            "dayYMD": "2024-01-26",
            "dayDMJ": "Fri. Jan. 26",
            "dayATCFormat": "01\/26\/2024",
            "masses": [
                {
                    "time": "5:30 pm",
                    "timeATC": "5:30 pm",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "6:30 pm ",
                    "timeATC": "6:30 pm ",
                    "description": "Low Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Saturday - Jan 27",
            "dayTS": 1706313600,
            "dayYMD": "2024-01-27",
            "dayDMJ": "Sat. Jan. 27",
            "dayATCFormat": "01\/27\/2024",
            "masses": [
                {
                    "time": "9:00 am",
                    "timeATC": "9:00 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "10:00 am",
                    "timeATC": "10:00 am",
                    "description": "Low Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Sunday - Jan 28",
            "dayTS": 1706400000,
            "dayYMD": "2024-01-28",
            "dayDMJ": "Sun. Jan. 28",
            "dayATCFormat": "01\/28\/2024",
            "masses": [
                {
                    "time": "6:30 am",
                    "timeATC": "6:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "7:00 am",
                    "timeATC": "7:00 am",
                    "description": "Low Mass",
                    "skip": false
                },
                {
                    "time": "8:30 am",
                    "timeATC": "8:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "9:00 am",
                    "timeATC": "9:00 am",
                    "description": "Low Mass",
                    "skip": false
                },
                {
                    "time": "10:30 am",
                    "timeATC": "10:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "11:00 am",
                    "timeATC": "11:00 am",
                    "description": "Sung Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Thursday - Feb 1",
            "dayTS": 1706745600,
            "dayYMD": "2024-02-01",
            "dayDMJ": "Thu. Feb. 1",
            "dayATCFormat": "02\/01\/2024",
            "masses": [
                {
                    "time": "7:00 pm",
                    "timeATC": "7:00 pm",
                    "description": "Holy Hour for Priests",
                    "skip": false
                }
            ]
        },
        {
            "day": "Friday - Feb 2",
            "dayTS": 1706832000,
            "dayYMD": "2024-02-02",
            "dayDMJ": "Fri. Feb. 2",
            "dayATCFormat": "02\/02\/2024",
            "masses": [
                {
                    "time": "5:30 pm",
                    "timeATC": "5:30 pm",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "6:30 pm ",
                    "timeATC": "6:30 pm ",
                    "description": "Sung Mass (Blessing of the Candles followed by procession)",
                    "skip": false
                }
            ]
        },
        {
            "day": "Saturday - Feb 3",
            "dayTS": 1706918400,
            "dayYMD": "2024-02-03",
            "dayDMJ": "Sat. Feb. 3",
            "dayATCFormat": "02\/03\/2024",
            "masses": [
                {
                    "time": "9:00 am",
                    "timeATC": "9:00 am",
                    "description": "Benediction",
                    "skip": false
                },
                {
                    "time": "10:00 am",
                    "timeATC": "10:00 am",
                    "description": "Low Mass (Blessing of the Throats)",
                    "skip": false
                }
            ]
        },
        {
            "day": "Sunday - Feb 4",
            "dayTS": 1707004800,
            "dayYMD": "2024-02-04",
            "dayDMJ": "Sun. Feb. 4",
            "dayATCFormat": "02\/04\/2024",
            "masses": [
                {
                    "time": "6:30 am",
                    "timeATC": "6:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "7:00 am",
                    "timeATC": "7:00 am",
                    "description": "Low Mass",
                    "skip": false
                },
                {
                    "time": "8:30 am",
                    "timeATC": "8:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "9:00 am",
                    "timeATC": "9:00 am",
                    "description": "Low Mass",
                    "skip": false
                },
                {
                    "time": "10:30 am",
                    "timeATC": "10:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "11:00 am",
                    "timeATC": "11:00 am",
                    "description": "Sung Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Friday - Feb 9",
            "dayTS": 1707436800,
            "dayYMD": "2024-02-09",
            "dayDMJ": "Fri. Feb. 9",
            "dayATCFormat": "02\/09\/2024",
            "masses": [
                {
                    "time": "5:30 pm",
                    "timeATC": "5:30 pm",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "6:30 pm ",
                    "timeATC": "6:30 pm ",
                    "description": "Low Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Saturday - Feb 10",
            "dayTS": 1707523200,
            "dayYMD": "2024-02-10",
            "dayDMJ": "Sat. Feb. 10",
            "dayATCFormat": "02\/10\/2024",
            "masses": [
                {
                    "time": "9:00 am",
                    "timeATC": "9:00 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "10:00 am",
                    "timeATC": "10:00 am",
                    "description": "Low Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Sunday - Feb 11",
            "dayTS": 1707609600,
            "dayYMD": "2024-02-11",
            "dayDMJ": "Sun. Feb. 11",
            "dayATCFormat": "02\/11\/2024",
            "masses": [
                {
                    "time": "6:30 am",
                    "timeATC": "6:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "7:00 am",
                    "timeATC": "7:00 am",
                    "description": "Low Mass",
                    "skip": false
                },
                {
                    "time": "8:30 am",
                    "timeATC": "8:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "9:00 am",
                    "timeATC": "9:00 am",
                    "description": "Low Mass",
                    "skip": false
                },
                {
                    "time": "10:30 am",
                    "timeATC": "10:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "11:00 am",
                    "timeATC": "11:00 am",
                    "description": "Sung Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Friday - Feb 16",
            "dayTS": 1708041600,
            "dayYMD": "2024-02-16",
            "dayDMJ": "Fri. Feb. 16",
            "dayATCFormat": "02\/16\/2024",
            "masses": [
                {
                    "time": "5:30 pm",
                    "timeATC": "5:30 pm",
                    "description": "Confessions",
                    "skip": false
                },
                {
                    "time": "5:50  pm",
                    "timeATC": "5:50  pm",
                    "description": "Way of the Cross ",
                    "skip": false
                },
                {
                    "time": "6:30 pm",
                    "timeATC": "6:30 pm",
                    "description": "Low Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Saturday - Feb 17",
            "dayTS": 1708128000,
            "dayYMD": "2024-02-17",
            "dayDMJ": "Sat. Feb. 17",
            "dayATCFormat": "02\/17\/2024",
            "masses": [
                {
                    "time": "9:00 am",
                    "timeATC": "9:00 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "10:00 am",
                    "timeATC": "10:00 am",
                    "description": "Low Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Sunday - Feb 18",
            "dayTS": 1708214400,
            "dayYMD": "2024-02-18",
            "dayDMJ": "Sun. Feb. 18",
            "dayATCFormat": "02\/18\/2024",
            "masses": [
                {
                    "time": "6:30 am",
                    "timeATC": "6:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "7:00 am",
                    "timeATC": "7:00 am",
                    "description": "Low Mass",
                    "skip": false
                },
                {
                    "time": "8:30 am",
                    "timeATC": "8:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "9:00 am",
                    "timeATC": "9:00 am",
                    "description": "Low Mass",
                    "skip": false
                },
                {
                    "time": "10:30 am",
                    "timeATC": "10:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "11:00 am",
                    "timeATC": "11:00 am",
                    "description": "Sung Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Monday - Feb 19",
            "dayTS": 1708300800,
            "dayYMD": "2024-02-19",
            "dayDMJ": "Mon. Feb. 19",
            "dayATCFormat": "02\/19\/2024",
            "masses": [
                {
                    "time": "8:00 am",
                    "timeATC": "8:00 am",
                    "description": "Low Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Friday - Feb 23",
            "dayTS": 1708646400,
            "dayYMD": "2024-02-23",
            "dayDMJ": "Fri. Feb. 23",
            "dayATCFormat": "02\/23\/2024",
            "masses": [
                {
                    "time": "5:30 pm",
                    "timeATC": "5:30 pm",
                    "description": "Confessions ",
                    "skip": false
                },
                {
                    "time": "5:50  pm",
                    "timeATC": "5:50  pm",
                    "description": "Way of the Cross ",
                    "skip": false
                },
                {
                    "time": "6:30 pm",
                    "timeATC": "6:30 pm",
                    "description": "Low Mass",
                    "skip": false
                },
                {
                    "time": "7:15 pm",
                    "timeATC": "7:15 pm",
                    "description": "Lenten recollection",
                    "skip": false
                }
            ]
        },
        {
            "day": "Saturday - Feb 24",
            "dayTS": 1708732800,
            "dayYMD": "2024-02-24",
            "dayDMJ": "Sat. Feb. 24",
            "dayATCFormat": "02\/24\/2024",
            "masses": [
                {
                    "time": "9:00 am",
                    "timeATC": "9:00 am",
                    "description": "Benediction \/ Confessions",
                    "skip": false
                },
                {
                    "time": "10:00 am",
                    "timeATC": "10:00 am",
                    "description": "Low Mass",
                    "skip": false
                },
                {
                    "time": "11:00 am",
                    "timeATC": "11:00 am",
                    "description": "Lenten recollection",
                    "skip": false
                },
                {
                    "time": "1:00 pm",
                    "timeATC": "1:00 pm",
                    "description": "Lenten recollection",
                    "skip": false
                }
            ]
        },
        {
            "day": "Sunday - Feb 25",
            "dayTS": 1708819200,
            "dayYMD": "2024-02-25",
            "dayDMJ": "Sun. Feb. 25",
            "dayATCFormat": "02\/25\/2024",
            "masses": [
                {
                    "time": "6:30 am",
                    "timeATC": "6:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "7:00 am",
                    "timeATC": "7:00 am",
                    "description": "Low Mass",
                    "skip": false
                },
                {
                    "time": "8:30 am",
                    "timeATC": "8:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "9:00 am",
                    "timeATC": "9:00 am",
                    "description": "Low Mass",
                    "skip": false
                },
                {
                    "time": "10:30 am",
                    "timeATC": "10:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "11:00 am",
                    "timeATC": "11:00 am",
                    "description": "Sung Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Friday - Mar 1",
            "dayTS": 1709251200,
            "dayYMD": "2024-03-01",
            "dayDMJ": "Fri. Mar. 1",
            "dayATCFormat": "03\/01\/2024",
            "masses": [
                {
                    "time": "5:30 pm",
                    "timeATC": "5:30 pm",
                    "description": "Confessions ",
                    "skip": false
                },
                {
                    "time": "5:50  pm",
                    "timeATC": "5:50  pm",
                    "description": "Way of the Cross ",
                    "skip": false
                },
                {
                    "time": "6:30 pm",
                    "timeATC": "6:30 pm",
                    "description": "Low Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Saturday - Mar 2",
            "dayTS": 1709337600,
            "dayYMD": "2024-03-02",
            "dayDMJ": "Sat. Mar. 2",
            "dayATCFormat": "03\/02\/2024",
            "masses": [
                {
                    "time": "9:00 am",
                    "timeATC": "9:00 am",
                    "description": "Benediction",
                    "skip": false
                },
                {
                    "time": "10:00 am",
                    "timeATC": "10:00 am",
                    "description": "Low Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Sunday - Mar 3",
            "dayTS": 1709424000,
            "dayYMD": "2024-03-03",
            "dayDMJ": "Sun. Mar. 3",
            "dayATCFormat": "03\/03\/2024",
            "masses": [
                {
                    "time": "6:30 am",
                    "timeATC": "6:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "7:00 am",
                    "timeATC": "7:00 am",
                    "description": "Low Mass",
                    "skip": false
                },
                {
                    "time": "8:30 am",
                    "timeATC": "8:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "9:00 am",
                    "timeATC": "9:00 am",
                    "description": "Low Mass",
                    "skip": false
                },
                {
                    "time": "10:30 am",
                    "timeATC": "10:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "11:00 am",
                    "timeATC": "11:00 am",
                    "description": "Sung Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Friday - Mar 8",
            "dayTS": 1709856000,
            "dayYMD": "2024-03-08",
            "dayDMJ": "Fri. Mar. 8",
            "dayATCFormat": "03\/08\/2024",
            "masses": [
                {
                    "time": "5:30 pm",
                    "timeATC": "5:30 pm",
                    "description": "Confessions ",
                    "skip": false
                },
                {
                    "time": "5:50  pm",
                    "timeATC": "5:50  pm",
                    "description": "Way of the Cross",
                    "skip": false
                },
                {
                    "time": "6:30 pm",
                    "timeATC": "6:30 pm",
                    "description": "Low Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Saturday - Mar 9",
            "dayTS": 1709942400,
            "dayYMD": "2024-03-09",
            "dayDMJ": "Sat. Mar. 9",
            "dayATCFormat": "03\/09\/2024",
            "masses": [
                {
                    "time": "9:00 am",
                    "timeATC": "9:00 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "10:00 am",
                    "timeATC": "10:00 am",
                    "description": "Low Mass",
                    "skip": false
                }
            ]
        },
        {
            "day": "Sunday - Mar 10",
            "dayTS": 1710028800,
            "dayYMD": "2024-03-10",
            "dayDMJ": "Sun. Mar. 10",
            "dayATCFormat": "03\/10\/2024",
            "masses": [
                {
                    "time": "6:30 am",
                    "timeATC": "6:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "7:00 am",
                    "timeATC": "7:00 am",
                    "description": "Low Mass",
                    "skip": false
                },
                {
                    "time": "8:30 am",
                    "timeATC": "8:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "9:00 am",
                    "timeATC": "9:00 am",
                    "description": "Low Mass",
                    "skip": false
                },
                {
                    "time": "10:30 am",
                    "timeATC": "10:30 am",
                    "description": "Confessions | Rosary",
                    "skip": false
                },
                {
                    "time": "11:00 am",
                    "timeATC": "11:00 am",
                    "description": "Sung Mass",
                    "skip": false
                }
            ]
        }
    ],
    "massTimesString": "Mass Times",
    "editPrintSelectionString": "Print selection",
    "parishChapelName": "Our Lady of Victory Church",
    "parishAddress": "4580 SW 65th Avenue\nDavie, FL  33314\n(954) 792-3162\n",
    "parishPlace": "Davie",
    "simplifiedLogo": true,
    "displayAppDescriptionIcon": false,
    "displayPrintIcon": true,
    "printSelectionCalendar": true
}
